## join

In [3]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [5]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [ ]:
df1.join(df2)            # must be stored in a new data

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

In [ ]:
df2.join(df1)      ## must be stored in a new data

          humidity  temperature
city
chicago         65           14
new york        68           21
orlando         75           35

In [8]:
combined_dfs = df1.join(df2)
combined_dfs

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

In [9]:
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [10]:
df2

          humidity
city
chicago         65
new york        68
orlando         75